Repository: weblate/site
Catalog: l10n/po/*/posts/2020-07-03-contribute-to-fedora.po
Languages: es, fi, uk

source: Régionalisation
es: Regionalización
fi: Alueellistaminen
uk: Регіоналізація

source: contribuer
es: contribuir
fi: osallistua
uk: участь

source: Comment contribuer à la traduction de la distribution Linux Fedora ?
es: ¿Cómo contribuir a la traducción de la distribución Linux Fedora?
fi: Kuinka osallistua Linux Fedora -jakelun kääntämiseen?
uk: Як можна посприяти перекладу дистрибутива Fedora Linux?

source: Une distribution est un type de projet de logiciel libre spécifique et complexe, sur lequel les objectifs et contraintes influent directement sur la capacité d’action du traducteur. Mais pour vous faciliter la vie, et améliorer celle de ceux [ne parlant pas anglais]({{< relref "2020-06-12-80-percent.md" >}}), Fedora met à disposition une plateforme de traduction.
es: Una distribución es un tipo concreto y complejo de proyecto de software libre cuyos objetivos y restricciones impactan directamente en la capacidad del traductor de actuar. Pero para facilitarle la vida y mejorar la de aquellos que [no hablan inglés]({{< relref "2020-06-12-80-percent.md" >}}), Fedora pone a disposición una plataforma de traducción.
fi: Jakelu on erityistyyppinen ja monimutkainen vapaa ohjelmisto -hanke, jonka tavoitteet ja rajoitukset vaikuttavat suoraan kääntäjän toimintakykyyn. Elämäsi helpottamiseksi ja niiden ihmisten [jotka eivät puhu englantia]({{< relref "2020-06-12-80-percent.md" >}}) parantamiseksi, Fedora tarjoaa käännösalustan.
uk: Дистрибутив — це специфічний і складний тип проєкту вільного програмного забезпечення, на якому цілі та обмеження безпосередньо впливають на роботу перекладача. Для того, щоб полегшити своє життя та покращити життя тих, [хто не розмовляє англійською мовою]({{< relref "2020-06-12-80-percent.md" >}}), Fedora пропонує платформу для перекладу.

source: Qu’est-ce qu’une distribution Linux ?
es: ¿Qué es una distribución Linux?
fi: Mikä on Linux-jakelu?
uk: Що таке дистрибутив Linux?

source: Une distribution Linux est un ensemble de logiciels, paramétrés de façon cohérente de façon à répondre à un besoin tout en respectant un ensemble de contraintes. Le cœur d’un projet de distribution tel que le projet Fedora, est une activité d’ingénierie logicielle permettant de compiler l’ensemble des logiciels afin de les mettre à disposition des utilisateurs et utilisatrices.
es: Una distribución Linux es un conjunto de programas configurados de manera coherente cuyo fin es responder a una necesidad concreta, respetando determinadas limitantes. El corazón de un proyecto de distribución como Fedora es una actividad de ingeniería de software que permite compilar el conjunto de programas en su totalidad para ponerlo a disposición de sus usuarios y usuarias.
fi: Linux-jakelu on joukko ohjelmistoja, jotka on konfiguroitu johdonmukaisella tavalla vastaamaan tarpeita samalla kun otetaan huomioon joukko rajoituksia. Jakeluprojektin, kuten Fedora-projektin, ydin on ohjelmistotuotantotoiminta, joka kokoaa kaikki ohjelmistot saataville käyttäjien saataville.
uk: Дистрибутив Linux — це набір програмного забезпечення, узгоджений для задоволення певної потреби при дотриманні набору обмежень. Основою проєкту дистрибутива, такого як проєкт Fedora, є робота інженерів-програмістів, результатом якої є збирання усього програмного забезпечення для того, щоб зробити його доступним для користувачів.

source: La problématique principale étant : comment puis-je actualiser le paramétrage sur l’ensemble de mes logiciels tout en facilitant la mise à jour de ces mêmes logiciels ?
es: La problemática principal siendo: ¿cómo puedo modernizar la configuración del conjunto de todos mis programas sin obstaculizar la actualización de estos?
fi: Pulma ratkettavana on seuraava: Kuinka voin päivittää kaikkien ohjelmistoni asetukset helpottaen samalla kyseisen ohjelmiston päivittämistä?
uk: Основна проблема полягає в тому, як можна оновити налаштування всього програмного забезпечення, полегшивши оновлення того самого програмного забезпечення?

source: Une distribution contient une quantité très importante de logiciels : plus de 30 000 pour Fedora ([source](https://src.fedoraproject.org/projects/rpms/*)). L’immense majorité de ces logiciels provient d’équipes n’ayant aucun lien direct avec le projet Fedora, par exemple le navigateur Mozilla Firefox, ou la suite bureautique LibreOffice. Une minorité de logiciels est créée spécifiquement pour le besoin propre du projet Fedora, tel l’installeur Anaconda.
es: Una distribución contiene una cantidad enorme de programas: más de 30 000 en el caso de Fedora ([fuente](https://src.fedoraproject.org/projects/rpms/*)). La inmensa mayoría de estos programas proviene de equipos que no tienen ningún vínculo directo con el proyecto Fedora; por ejemplo, el navegador Mozilla Firefox, o la suite de oficina LibreOffice. Una minoría de programas se ha creado específicamente para necesidades propias del proyecto Fedora, como el instalador Anaconda.
fi: Jakelu sisältää huomattavan määrän ohjelmistoja: yli 80 000 Fedoralle ([lähde](https://src.fedoraproject.org/projects/rpms/*)). Suurin osa ohjelmistosta tulee tiimeiltä, joilla ei ole suoraa yhteyttä Fedora-projektiin, esimerkiksi Mozilla Firefox -selain tai LibreOffice-toimistopaketti. Vähemmistö ohjelmistoista on luotu erityisesti Fedora-projektin erityistarpeisiin, kuten Anaconda-asennusohjelma.
uk: Дистрибутив містить дуже велику кількість програмного забезпечення: понад 30 000 пакунків для Fedora ([джерело](https://src.fedoraproject.org/projects/rpms/*)). Переважна більшість цього програмного забезпечення надходить від команд, що не мають прямого зв'язку з проектом Fedora, наприклад, браузера Mozilla Firefox або набору офісних програм LibreOffice. Менша частина програм створюється спеціально для конкретних потреб проєкту Fedora, наприклад, програма встановлення Anaconda.

source: La distribution Linux Fedora et ses valeurs
es: La distribución Linux Fedora y sus valores
fi: Linux Fedora -jakelu ja sen arvot
uk: Дистрибутив Fedora та його значення

source: La distribution Linux Fedora est dite générique, elle vise à répondre à divers besoins : l’utilisation sur un poste de travail et sur serveur. Pour les postes de travail les deux possibilités mises en avant sont les éditions « Fedora workstation » et « Fedora Silverblue ». Pour les serveurs, Fedora peut s’installer en tant qu’OS installé sur du matériel classique (« Fedora Server »), sur du matériel embarqué (« Fedora IOT ») ou conteneurisé (« Fedora CoreOS »).
es: La distribución Linux Fedora se conoce como «genérica» porque busca dar solución a necesidades diversas: puede emplearse tanto en una estación de trabajo como en servidores. Para las estaciones de trabajo, hay dos opciones recomendadas: las ediciones Workstation y Silverblue. Para los servidores, Fedora puede instalarse sobre soporte físico tradicional (Fedora Server), en dispositivos especializados (Fedora IOT) o en contenedores (Fedora CoreOS).
fi: Linux Fedora -jakelua kutsutaan yleiseksi, ja sen tarkoituksena on täyttää erilaiset tarpeet: käyttö työasemassa ja palvelimella. Työasemia varten esitetyt kaksi mahdollisuutta ovat "Fedora-työasema" ja "Fedora Silverblue" -versiot. Palvelimia varten Fedora voidaan asentaa käyttöjärjestelmänä, joka on asennettu vakiolaitteistoon ("Fedora Server"), sisäiseen ("Fedora IOT") tai konttilaitteistoon ("Fedora CoreOS").
uk: Дистрибутив Fedora Linux є дистрибутивом загального призначення — його призначено для задоволення різних потреб: використання на робочій станції та на сервері. Для робочих станцій призначено два варіанти: «Fedora workstation» та «Fedora Silverblue». Для серверів Fedora можна встановити як операційну систему, встановлену на стандартному апаратному забезпеченні («Fedora Server»), на вбудованих апаратних системах («Fedora IoT») або на контейнерах («Fedora CoreOS»).

source: On voit ici que rien n’est simple, derrière le concept de « distribution Linux », on voit qu’une même série de logiciels peut être paramétrée de façon différente pour répondre à des objectifs distincts.
es: Como se puede apreciar, nada es simple tras el concepto de «distribución Linux»; vemos que una misma serie de programas puede configurarse de maneras distintas para atender a diferentes objetivos.
fi: Mikään ei ole yksinkertaista Linux-jakelun käsitteen takana; sama ohjelmistosarja voidaan konfiguroida eri tavoin eri tavoitteiden saavuttamiseksi.
uk: Отже, поняття «дистрибутив Linux» приховує за собою доволі складну конструкцію — однакові набори програмного забезпечення можна налаштувати по-різному для досягнення різних цілей.

source: En plus de ces multiples paramétrages, la distribution Linux Fedora s’impose les contraintes suivantes : l’utilisation exclusive de logiciels libres, être à la pointe des évolutions en réalisant notamment des sorties fréquentes, avoir une contribution directe aux logiciels plutôt que de concevoir et maintenir une surcouche de modifications.
es: Además de esta variedad de configuraciones, la distribución Linux Fedora se impone las limitantes siguientes: el uso exclusivo de software libre, estar a la vanguardia de sus evoluciones (en particular, realizando publicaciones frecuentes) y contribuir directamente con el software en vez de concebir y mantener una capa de modificaciones por encima.
fi: Näiden useiden asetusten lisäksi Fedora Linux -jakelussa asetetaan seuraavia rajoituksia: ilmaisten ohjelmistojen yksinomainen käyttö, olla kehityksen eturintamassa tekemällä usein julkaisuja, osallistua suoraan ohjelmistoihin sen sijaan, että suunnitellaan ja ylläpidetään peittokuvaa muutoksista.
uk: На додаток до цих кількох налаштувань дистрибутив Fedora Linux накладає такі обмеження: використання лише вільного програмного забезпечення, використання в основному передових розробок шляхом частого випуску, безпосередній внесок у програмне забезпечення, а не розробка і підтримання власних модифікацій програмного забезпечення.

source: Pour plus de détails, je vous recommande la lecture de cette page décrivant Fedora et ses quatre fondations : https://docs.fedoraproject.org/en-US/project/
es: Para más detalles, le recomiendo la lectura de esta página que describe Fedora y sus cuatro principios: https://docs.fedoraproject.org/en-US/project/
fi: Tietoa Fedorasta ja sen neljästä perustuksen arvosta: https://docs.fedoraproject.org/en-US/project/
uk: Для отримання докладніших відомостей рекомендуємо прочитати цю сторінку з описом Fedora та її чотирьох основ: https://docs.fedoraproject.org/en-US/project/

source: La conséquence sur le rôle du traducteur dans le projet Fedora
es: Las ramificaciones del papel de traductor en el proyecto Fedora
fi: Seuraukset kääntäjän rooliin Fedora-hankkeessa
uk: Наслідок для ролі перекладача у проекті Fedora

source: Quand vous vous rendrez sur la plateforme de traduction du projet Fedora https://translate.fedoraproject.org/projects/ vous ne trouverez qu’une petite partie de tous les logiciels disponibles réellement quand vous installez Fedora.
es: Cuando entra en la plataforma de traducción del proyecto Fedora https://translate.fedoraproject.org/projects/, encontrará solo una pequeña parte de todo el software disponible realmente cuando instala Fedora.
fi: Kun siirryt Fedora-hankkeen käännösalustalle https://translate.fedoraproject.org/projects/, löydät vain pienen osan kaikista ohjelmistoista, jotka ovat käytettävissä, Fedora-asennuksen aikana.
uk: Перейшовши на сторінку https://translate.fedoraproject.org/projects/ платформи перекладів проєктів Fedora, ви знайдете лише невелику частину всього наявного при встановленні Fedora програмного забезпечення.

source: La plateforme de traduction de Fedora contient : * Les logiciels que sa communauté a créé, par exemple l’installeur anaconda https://translate.fedoraproject.org/projects/anaconda/ * Les sites internets du projet Fedora : https://translate.fedoraproject.org/projects/fedora-websites/ * La documentation du projet Fedora : https://translate.fedoraproject.org/projects/fedora-docs-l10n-docs/ (et tous les autres projets débutants par fedora-docs-l10n) * Des logiciels dont les créateurs ont décidé de faire héberger leurs traductions au sein du projet Fedora : tels pulseaudio https://translate.fedoraproject.org/projects/pulseaudio/ ou ibus https://translate.fedoraproject.org/projects/ibus/
es: La plataforma de traducción de Fedora contiene: * Los programas que su comunidad ha creado, como el instalador Anaconda https://translate.fedoraproject.org/projects/anaconda/ * Los sitios de internet del proyecto Fedora: https://translate.fedoraproject.org/projects/fedora-websites/ * La documentación del proyecto Fedora: https://translate.fedoraproject.org/projects/fedora-docs-l10n-docs/ (y todos los proyectos que inician por fedora-docs-l10n) * Programas cuyos creadores han decidido alojar sus traducciones en el seno del proyecto Fedora, tales como: Pulseaudio https://translate.fedoraproject.org/projects/pulseaudio/ e IBus https://translate.fedoraproject.org/projects/ibus/
fi: Fedoran käännösalusta sisältää: * Yhteisön luoman ohjelmiston, esimerkiksi anacondan asennusohjelman https://translate.fedoraproject.org/projects/anaconda/ * Fedora-projektin verkkosivustot: https://translate.fedoraproject.org/projects/fedora-websites/ *Fedora-projektidokumentaatio: https://translate.fedoraproject.org/projects/fedora-docs-l10n-docs/ (ja kaikki muut fedora-docs- l10n:sta alkavat projektit) * Ohjelmistot, joiden luojat ovat päättäneet isännöimään käännöksiä Fedora-hankkeessa: tällainen pulseaudio https://translate.fedoraproject.org/projects/pulseaudio/ tai ibus https://translate.fedoraproject.org/projects/ibus/
uk: Платформа перекладу Fedora містить такі компоненти: * Програмне забезпечення, яке створила спільнота дистрибутива, наприклад, програма для встановлення anaconda https://translate.fedoraproject.org/projects/anaconda/ * Вебсайти проєкту Fedora: https://translate.fedoraproject.org/projects/fedora-websites/ * Документація до проєкту Fedora: https://translate.fedoraproject.org/projects/fedora-docs-l10n-docs/ (та всі інші проекти, що починаються з fedora-docs- l10n) * Програмне забезпечення, творці якого вирішили розмістити свої переклади у межах проєкту Fedora: pulseaudio https://translate.fedoraproject.org/projects/pulseaudio/ або ibus https://translate.fedoraproject.org/projects/ibus/

source: Pour tout le reste, il faudra trouver où est hébergé le logiciel et comprendre comment y contribuer. Mais cela sera le sujet d’un autre article.
es: Para el resto, deberá descubrir dónde se hospeda cada programa y cómo puede contribuir a este. Pero esto será material para otro artículo.
fi: Kaiken muun suhteen sinun on löydettävä ohjelmiston isännöintikohde ja ymmärrettävä, miten voit osallistua. Mutta siitä on toisen artikkelin aihe.
uk: Для всього іншого вам доведеться знайти місце розміщення програмного забезпечення та зрозуміти, як зробити свій внесок. Але це буде предметом іншого допису.

source: Conclusion
es: Conclusión
fi: Yhteenveto
uk: Висновок

source: Même si une distribution Linux est un ensemble complexe, y contribuer est facile. La seule question à se poser quand on arrive sur une plateforme de traduction, c’est de s’assurer de comprendre ce qu’on y voit, dans le projet Fedora, c’est toujours le logiciel d’origine, sans intermédiaire.
es: Aunque una distribución Linux es un ente complejo, es sencillo contribuir a esta. La única pregunta que deberá realizarse cuando llega a una plataforma de traducción consiste en cerciorarse de que entiende lo que ve; en el proyecto Fedora, siempre se trata del software original, sin intermediarios.
fi: Vaikka Linux-jakelu on monimutkainen kokonaisuus, siihen osallistuminen on helppoa. Ainoa kysymys, joka sinun tulee kysyä itseltäsi, kun laskeudut käännösalustalle, on varmistaa, että ymmärrät mitä näet siellä, Fedora-projektissa, se on edelleen alkuperäinen ohjelmisto ilman välikäsiä.
uk: Незважаючи на те, що дистрибутив Linux — це складне ціле, сприяти перекладу легко. Єдине питання, яке потрібно задати собі, коли ви сідаєте за переклад, — це переконатися, що ви розумієте, з чим ви маєте справу. У проєкті Fedora це оригінальне програмне забезпечення, без посередників.
