Repository: weblate/site
Catalog: l10n/po/*/posts/2020-06-12-80-percent.po
Languages: es, fi

source: Régionalisation
es: Regionalización
fi: Alueellistaminen

source: Internationalisation
es: Internacionalización
fi: Kansainvälistyminen

source: enjeux
es: retos
fi: panokset

source: partage
es: compartición
fi: jako

source: Quand 80% de l’humanité ne parle pas anglais
es: Cuando el 80 % de la humanidad no habla inglés
fi: Kun ehkä noin kahdeksan kymmentä prosenttia maailman väestöstä ei puhu englantia

source: Alors que l’écosystème du logiciel libre est très anglophone, prendre en charge plusieurs langues dans un logiciel permet de multiplier par 5 ou par 10 le nombre d’utilisateur·rice·s potentiels. Cela représente une complexité et un coût élevé mais unique, qui une fois fait, sous réserve d’automatisation, autorise un nombre illimité de langues.
es: Aunque el ecosistema del software libre sea bastante anglófono, admitir otros idiomas en un programa permite multiplicar por cinco o por diez el número de usuarios potenciales. Esto supone una complejidad y un costo alto, aunque único, que al asumirse, salvo que se emplee automatización, permite un número ilimitado de lenguas.
fi: Vapaiden ohjelmistojen ekosysteemi on nykyisin enimmäkseen englanninkielinen ja syystäkin. Usean ohjelmistoon liittyvän kielen tukeminen voi kertoa potentiaalisten käyttäjien määrällä 5 tai jopa enemmän. Tämä edustaa suurta, mutta ainutlaatuista monimutkaisuutta ja kustannuksia, jotka investoinnin jälkeen ja automatisoituna mahdollistavat tuen rajoittamattoman määrän kieliä.

source: Un écosystème très anglophone
es: Un ecosistema muy anglófono
fi: Ekosysteemi enimmäkseen englanninkielinen

source: Le monde du logiciel libre et open-source est très divers, allant des couches d’interactions avec le matériel jusqu’aux logiciels que nous utilisons quotidiennement sur nos ordinateurs et téléphones. Tous ces outils n’existent que par et pour ses utilisateurs et utilisatrices. Certain·e·s seront intéressé·e·s par l’outil et y contribueront, d’autres voudront juste atteindre leur but le plus rapidement possible.
es: El mundo del software libre y de código abierto es sumamente diverso, y abarca desde las capas de interacción con el hardware hasta los programas que utilizamos cotidianamente en nuestros computadores y teléfonos. Todas estas herramientas existen exclusivamente por y para sus usuarios y usuarias. Algunos de ellos se interesarán por la herramienta y contribuirán a esta; otros solo se interesarán en alcanzar sus propios objetivos de la manera más ágil posible.
fi: Vapaan Ohjelmiston ja Avoimen Lähdekoodin maailmat ovat hyvin monipuolisia, aina vuorovaikutuksesta laitteiston kanssa tietokoneisiin ja matkapuhelimiin päivittäin käyttämiimme ohjelmistoihin. Kaikki nämä työkalut ovat olemassa vain sen käyttäjille. Jotkut ovat kiinnostuneita työkalusta ja auttavat sitä, toiset haluavat vain saavuttaa tavoitteensa mahdollisimman nopeasti.

source: Dans le monde du logiciel libre, l’anglais est la langue de travail par défaut, et l’écrit y est le canal le plus utilisé. Ce fonctionnement est un standard de fait, et accepté sans grande difficulté par ce qu’on appelle la communauté du logiciel libre, terme générique qui englobe l’ensemble des personnes contribuant à un ou plusieurs logiciels libres.
es: En el mundo del software libre, el inglés es la lengua de trabajo por omisión, mayormente utilizada de manera escrita. Este funcionamiento es un estándar de facto, aceptado sin muchas dificultades por lo que se denomina «la comunidad del software libre», un término genérico que engloba el conjunto de personas que contribuyen a uno o más programas libres.
fi: Vapaiden ohjelmistojen maailmassa englanti on tosiasiallisesti työkieli, ja kirjoittaminen on sen yleisimmin käytetty kanava. Tämä tilanne on kuin standardi, ja niin kutsuttu vapaiden ohjelmistojen yhteisö hyväksyy sen ilman suurempia vaikeuksia, yleinen termi, joka kattaa kaikki ihmiset, jotka osallistuvat yhteen tai useampaan vapaaseen ohjelmistoon.

source: Par confort, les personnes créant des logiciels utilisent souvent l’anglais plutôt que leur langue maternelle. En conséquence, ils comprennent rarement les difficultés rencontrées lors de la traduction (phrases découpées en plusieurs fragments, variables non nommées, jargon technique intraduisible, etc.).
es: Por comodidad, los desarrolladores de software utilizan a menudo el inglés en vez de su lengua materna. Consecuentemente, ellos rara vez comprenden las dificultades que implica la traducción (frases cortadas en varios fragmentos, variables sin nombre, jerga técnica difícil de comprender y traducir, etc.).
fi: Ohjelmiston luojien on helppo käyttää englantia äidinkielensä sijaan. Tämän seurauksena he ymmärtävät harvoin käännöksen aikana kohdatut vaikeudet (lauseet, jotka on jaettu useaan osaan, nimeämättömät muuttujat, käännettämätön tekninen ammattikieltä jne.).

source: Pire encore, ces personnes peuvent être mise mal à l’aise par le manque de contrôle sur ce qui est effectivement affiché à l’utilisateur.
es: Peor aún, estas personas pueden sentirse incómodas por la falta de control sobre lo que en efecto se muestra al usuario.
fi: Jotkut henkilöt saatavat kokea epämiellyttäväksi hallinnan puute näyttöön näytettävistä tiedoista.

source: Une population mondiale peu anglophone
es: Una población mundial escasamente anglófona
fi: Kohtuullisesti englanninkielinen maailman väestö

source: Il y a de grandes chances pour que les utilisateurs et utilisatrices aient une langue maternelle qui ne soit pas l’anglais. Et inciter les développeurs à utiliser leur langue maternelle ne résous pas le problème, car il y a toutes les chances pour que cette langue maternelle ne soit pas celle des développeurs en charge de l’outil.
es: Es muy probable que la lengua materna de los usuarios no sea el inglés. E invitar a los desarrolladores a utilizar su lengua materna no soluciona el problema, dado que es muy probable que esta lengua no sea la de los desarrolladores a cargo de la herramienta.
fi: Kehittäjien kannustaminen käyttämään äidinkieltään, kun se ei ole englantia, ei ole vaihtoehto, koska suurin osa IT-työkaluista vastaavista kehittäjistä ympäri maailmaa puhuu juuri englantia.

source: Quelle que soit leur langue, les utilisateurs et utilisatrices préfèreront utiliser leur propre langue pour atteindre leur but, car cela augmente leur confort d’utilisation et leur efficacité. Utiliser sa langue peut également être un prérequis pour utiliser le logiciel, en cas d’absence de maîtrise de l’anglais.
es: Independientemente del idioma, los usuarios prefieren utilizar su propia lengua para alcanzar sus objetivos, puesto que esto aumenta la comodidad de uso y la eficacia. El poder utilizar su lengua también puede ser un prerrequisito para emplear el programa, en caso de no dominar el inglés.
fi: Ihmisten tulisi mieluummin käyttää äidinkieltään myös silloin, kun se ei ole englantia, tavoitteen saavuttamiseksi, suorituskyvyn ja tehokkuuden lisäämiseksi. tämä voi olla edellytys niille, jotka eivät puhu englantia.

source: Dans le détail, il existe des estimations de population par langue et territoire fournies par le consortium Unicode, et plus particulièrement le CLDR. [Ces estimations indiquent que 21 %](https://github.com/unicode-org/cldr/commits/master/tools/java/org/unicode/cldr/util/data/country_language_population_raw.txt) des habitant·e·s de la planète parleraient anglais. Mais ici, parler englobe des situations très diverses, si on considère les personnes ayant un niveau natif ou courant, nous descendons à 9 %.
es: Existen estimaciones pormenorizadas de población por lengua y territorio provistas por el Consorcio Unicode, o más específicamente, por el CLDR. [Estas estimaciones indican que un 21 %](https://github.com/unicode-org/cldr/commits/master/tools/java/org/unicode/cldr/util/data/country_language_population_raw.txt) de los habitantes del planeta hablarían inglés. No obstante, aquí «hablar» implica situaciones muy diversas; si se considera a las personas con nivel nativo o que dominan el uso actual, este porcentaje se reduce al 9 %.
fi: CLDR- ja Unicode-konsortiot julkaisevat väestöarvioita kielen ja alueen mukaan. [Viimeksi mainitun mukaan vuonna [] olisi ollut 21 %](https://github.com/unicode-org/cldr/commits/master/tools/java/org/unicode/cldr/util/data/country_language_population_raw.txt) ihmisiä ympäri maailmaa, jotka puhuvat englantia. Puhuminen on ymmärrettävä laajassa merkityksessä. Yhä näiden organisaatioiden mukaan, heitä olisi yhdeksän prosenttia, kun otetaan huomioon vain ihmiset, joilla on syntyperäinen tai sujuva englanti.

source: L’enjeu en cherchant à augmenter le nombre d’utilisateurs est d’augmenter le nombre potentiel de contributeurs et contributrices, qui viendront faire leurs premiers pas par une correction de traduction ou une traduction complète, puis qui peuvent continuer sur des activités plus ou moins techniques (communication, assistance, documentation, tests, codage...). Il est possible de ne pas connaître la langue source du logiciel, mais d’utiliser une autre langue comme pivot pour réaliser une traduction.
es: El desafío de buscar aumentar el número de usuarios consiste de aumentar el número potencial de contribuidores, quienes darán sus primeros pasos a través de una corrección de traducción o de una traducción completa, para pasar a realizar otras actividades más o menos técnicas (comunicación, asistencia, documentación, pruebas, programación…). Es posible no conocer la lengua de origen del programa y utilizar otra lengua como apoyo para realizar una traducción.
fi: Haasteena käyttäjien lukumäärän kasvattamisessa on lisätä mahdollista osallistujien määrää, jotka ottavat ensimmäiset askeleensa käännöksen korjauksella tai täydellisellä käännöksellä ja jotka voivat jatkaa enemmän tai vähemmän teknisiä toimintoja (viestintä, apu, dokumentointi , testit, koodaus ...).

source: Pour pouvoir démultiplier les utilisateurs et utilisatrices potentiels, il faut ajouter le support linguistique. C’est ce qu’on appelle l’internationalisation.
es: Para incrementar el número de usuarios potenciales, es necesario añadir compatibilidad lingüística. A esto es lo que denominamos internacionalización.
fi: Käyttäjien määrän lisäämiseksi kielellisen tuen on oltava olemassa. Tätä kutsutaan kansainvälistymiseksi.

source: La complexité de l’internationalisation
es: La complejidad de la internacionalización
fi: Kansainvälistymisen monimutkaisuus

source: Prendre en charge de multiples langues nécessite :
es: Para admitir varios idiomas se necesita:
fi: Useiden kielten tukeminen vaatii:

source: d’utiliser des outils qui offrent les fonctionnalités nécessaires (marquer les contenus à traduire, les traduire et les diffuser)
es: emplear herramientas que ofrezcan las funcionalidades necesarias (marcar el contenido para traducir, traducirlo y diseminarlo)
fi: käyttää työkaluja, jotka tarjoavat tarvittavat toiminnot (merkitse käännettävä sisältö, käännä ja jaa ne)

source: de changer ses processus de conception logicielle pour intégrer le travail de traduction (quand le code est terminé, il faut informer les personnes réalisant les traduction et intégrer leurs travaux)
es: cambiar sus procesos de diseño de software para integrar el trabajo de traducción (cuando el código se finaliza, debe informarse a las personas que realizan las traducciones e integrarse su labor)
fi: muuta ohjelmistojen suunnitteluprosesseja käännöstyön integroimiseksi (kun koodi on valmis, sinun on ilmoitettava siitä käännösten tekeville ihmisille ja integroitava heidän työnsä)

source: de répondre aux besoins liés à l’activité de traduction. Cela nécessite de s’intéresser aux codifications, aux formats de traduction, aux pluriels, à l’outillage adapté, etc.
es: atender las necesidades vinculadas a la actividad de traducción. Esto necesita un interés en la programación, los formatos de traducción, las formas de pluralización, la adaptación de herramientas, etc.
fi: vastaamaan käännösliiketoiminnan tarpeisiin. Tämä edellyttää huomiota kodifikaatioihin, käännösmuotoihin, monikkoihin, sopiviin työkaluihin jne.

source: Et au-delà de l’interface utilisateur, il faut également inclure les interface en ligne de commande, les sites web de présentation, des lettres d’information, la documentation en ligne, les pages man, les notes de version...
es: Y además de la interfaz de usuario, también debemos incluir la interfaz de línea de órdenes, los sitios web de presentación, los boletines informativos, la documentación en línea, las páginas de manual, los informes de novedades por versión…
fi: Käyttöliittymän lisäksi sinun tulisi myös sisällyttää komentoriviliittymät, yleiskatsaus verkkosivustot, uutiskirjeet, online-ohjeet, man-sivut, julkaisutiedot ....

source: Internationaliser coûte du temps et nécessite des compétences techniques avancées. Malheureusement, certains outils utilisés par les logiciels n’offrent aucune aide, l’expert·e qui devra se débrouiller seul·e ou changer d’outil.
es: La internacionalización cuesta tiempo y requiere competencias técnicas avanzadas. Desafortunadamente, algunas herramientas de software no incluyen ayuda, por lo que el experto deberá valerse por sí mismo o cambiar de herramienta.
fi: Kansainvälistyminen on aikaa vievä ja vaatii edistyneitä teknisiä taitoja. Valitettavasti jotkut ohjelmistojen käyttämät työkalut eivät tarjoa mitään apua, asiantuntijalle, joka joutuu puolustamaan itseään tai vaihtamaan työkaluja.

source: La bonne nouvelle est que ce travail n’est à mener qu’une seule fois pour un nombre théoriquement illimité de langues. C’est une bonne nouvelle, car il existe aujourd’hui entre 7000 et 9000 langues, dont près de 2500 sont en risque de disparition. S’il fallait mener un travail dédié par langue, rare seraient les développeurs et développeuses qui accepteraient de dépenser d’énergie pour une langue ayant un nombre de locuteurs très faibles. Et à notre époque, ne pas exister sur les outils numériques est dangereux.
es: La buena noticia es que este trabajo solo necesita hacerse una vez para admitir una cantidad teóricamente ilimitada de lenguas. Es buena noticia porque existen hoy en día entre 7000 y 9000 lenguas, de las cuales más de 2500 están en riesgo de desaparecer. Si fuera necesario realizar un trabajo especializado por idioma, pocos serían los desarrolladores dispuestos a invertir esfuerzos en un idioma con un número reducido de hablantes. Y en nuestra época, no tener presencia en el mundo digital es peligroso.
fi: Tämä työ on tehtävä vain kerran rajattomalle määrälle kieliä. Tämä on hyvä uutinen, koska nykyään on 7000–9000 kieltä, joista lähes 2500 on sukupuuttoon vaarassa. Jos joudumme tekemään omistettua työtä kieltä kohden, harvat kehittäjät olisivat valmiita käyttämään energiaa kielelle, jolla on merkityksetön määrä puhujia.

source: Le rôle de Languages-in-floss
es: El papel de Languages-in-floss
fi: Languages-in-floss:n rooli

source: Dans ce contexte, l’initiative Languages-in-floss vise à vous partager nos expériences de terrain pour la prise en charge du français, de l’arabe, du kabyle et de l’occitan.
es: En este contexto, la iniciativa Languages-in-floss tiene por objeto compartir con usted nuestras experiencias en terreno al hacerse cargo de proyectos en francés, árabe, cabilio y occitano.
fi: Tässä yhteydessä aloitteen Languages-in-floss tarkoituksena on jakaa kentällä kokemuksemme kanssasi näiden kielten tukemisessa: ranska, oksitaani, kabyle ja arabia.

source: Que vous soyez promoteur ou défenseur d’une langue, ou que vous soyez développeur, vous découvrirez que le multilinguisme est possible dans toute activité liée au logiciel libre et open-source, nous allons essayer de vous faciliter la vie dans ce monde complexe.
es: Sea usted promotor de una lengua o desarrollador de software, descubrirá que el plurilingüismo es posible en cualquier actividad ligada al software libre y de código abierto; intentaremos facilitarle la vida en este mundo complejo.
fi: Olitpa kielen edistäjä tai puolustaja, saat huomata, että monikielisyys on mahdollista kaikessa toiminnassa, joka liittyy vapaan ohjelmistoon ja avoimeen lähdekoodiin, yritämme helpottaa elämääsi tässä monimutkaisessa maailmassa.
